# ===========================================
# VS Code Extensions for Hydra Student Containers
# LITE version - core extensions only
# Additional extensions available via recommendations
# ===========================================

# ----- CORE (Always Installed) -----

# C/C++ language server - essential for CS courses
llvm-vs-code-extensions.vscode-clangd

# Python - essential for CS courses
ms-python.python

# Java Extension Pack - essential for CS courses
redhat.java
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven

# Code Runner - run code snippets quickly
formulahendry.code-runner

# ESLint - JavaScript linting
dbaeumer.vscode-eslint

# Prettier - code formatter
esbenp.prettier-vscode

# Better C++ Syntax highlighting
jeff-hykin.better-cpp-syntax

# CMake support (lightweight)
twxs.cmake

# Makefile Tools
ms-vscode.makefile-tools

# Native Debug - GDB/LLDB for C/C++
webfreak.debug

# Path Intellisense - autocomplete paths
christian-kohler.path-intellisense

# Jenkins/CI-CD & Groovy
secanis.jenkinsfile-support
janjoerke.jenkins-pipeline-linter-connector
marlon407.code-groovy
NicolasVuillamy.vscode-groovy-lint

# ----- CUSTOM (built from source) -----
# LCC Tools - Built from GitHub source
# See Dockerfile for build step

# ===========================================
# OPTIONAL (available on-demand)
# Students can install these from Extensions panel
# They appear in "Recommended" section
# ===========================================
# James-Yu.latex-workshop       # LaTeX (~80MB) - install if needed
# Vue.volar                     # Vue.js - install if needed
# bmewburn.vscode-intelephense-client  # PHP - install if needed
# ms-azuretools.vscode-docker   # Docker - install if needed
# ms-vscode.hexeditor           # Hex editor - install if needed
# ms-vscode.cmake-tools         # CMake Tools - install if needed
# github.vscode-github-actions  # GitHub Actions - install if needed
# vscjava.vscode-gradle         # Gradle - install if needed
# ritwickdey.liveserver         # Live Server - install if needed
# ecmel.vscode-html-css         # HTML/CSS - install if needed
# dsznajder.es7-react-js-snippets # React - install if needed
