# ===========================================
# VS Code Extensions for Hydra Student Containers
# Sorted by approximate size (largest first)
# ===========================================

# ----- LARGE (50-200+ MB) -----

# Java Pack - includes debugger, test runner, Maven, Gradle support (~150-200MB)
vscjava.vscode-java-pack

# LaTeX Workshop - full LaTeX IDE with PDF preview (~80-100MB)
James-Yu.latex-workshop

# ----- MEDIUM (10-50 MB) -----

# Clangd - C/C++ language server (alternative to ms-vscode.cpptools) (~40-50MB)
llvm-vs-code-extensions.vscode-clangd

# Python - debugging, linting, IntelliSense (~40-50MB)
ms-python.python

# Go - full Go language support (~30-40MB)
golang.go

# Docker - Dockerfile support, container management (~20-30MB)
ms-azuretools.vscode-docker

# Vue (Volar) - Vue 3 language support (~20-25MB)
Vue.volar

# Database Client - SQL viewer, query runner, supports MySQL/PostgreSQL/SQLite/etc (~15-25MB)
cweijan.vscode-database-client2

# PHP Intelephense - PHP IntelliSense (~15-20MB)
bmewburn.vscode-intelephense-client

# Hex Editor - view/edit binary files in hex (~10-15MB)
ms-vscode.hexeditor

# CMake - CMake language support (~10-15MB)
twxs.cmake

# CMake Tools - CMake project management (~10-15MB)
ms-vscode.cmake-tools

# Native Debug - GDB/LLDB debugging for C/C++/Rust (~8-12MB)
webfreak.debug

# ----- SMALL (1-10 MB) -----

# ESLint - JavaScript/TypeScript linting (~5-8MB)
dbaeumer.vscode-eslint

# Prettier - code formatter (~5-8MB)
esbenp.prettier-vscode

# Code Runner - run code snippets (~3-5MB)
formulahendry.code-runner

# GitHub Actions - workflow syntax (~3-5MB)
github.vscode-github-actions

# Gradle support (~3-5MB)
vscjava.vscode-gradle

# Maven support (~3-5MB)
vscjava.vscode-maven

# Live Server - local dev server (~2-4MB)
ritwickdey.liveserver

# Error Lens - REMOVED (too noisy for students)
# usernamehw.errorlens

# Better C++ Syntax - enhanced C/C++ syntax highlighting (~1-2MB)
jeff-hykin.better-cpp-syntax

# Makefile Tools - Makefile support and IntelliSense (~2-3MB)
ms-vscode.makefile-tools

# ----- TINY (<1 MB) -----

# x86/x64 Assembly - syntax highlighting (~500KB)
13xforever.language-x86-64-assembly

# MIPS Assembly - syntax highlighting + snippets (~200KB)
kdarkhan.mips

# ARM Assembly - syntax highlighting (~200KB)
dan-c-underwood.arm

# RISC-V Assembly - syntax highlighting (~150KB)
zhwu95.riscv

# HTML/CSS IntelliSense (~500KB)
ecmel.vscode-html-css

# React Snippets (~300KB)
dsznajder.es7-react-js-snippets

# Path Intellisense (~200KB)
christian-kohler.path-intellisense

# Hexdump - alternative hex viewer (~100KB)
slevesque.vscode-hexdump

# ----- VS CODE EXCLUSIVE (not available in code-server) -----
# ms-python.vscode-pylance  # Python IntelliSense (VS Code only)
# ms-vscode.cpptools        # C/C++ (VS Code only) -> Use llvm-vs-code-extensions.vscode-clangd instead
# ms-vscode-remote.remote-ssh  # Remote SSH (VS Code only)

# ----- CUSTOM (built from source) -----
# LCC Tools - Built from GitHub source (not on Open VSX)
# See Dockerfile for build step from https://github.com/lettucegoblin/vscode-lcc
# Provides: LCC compilation, assembly viewing, debugging support
