# ===========================================
# VS Code Extensions for Hydra Student Containers
# LITE version - core extensions only
# Additional extensions available via recommendations
# ===========================================

# ----- CORE (Always Installed) -----

# C/C++ language server - essential for CS courses
llvm-vs-code-extensions.vscode-clangd

# Python - essential for CS courses
ms-python.python

# Java Extension Pack - essential for CS courses
redhat.java
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven

# Code Runner - run code snippets quickly
formulahendry.code-runner

# ESLint - JavaScript linting
dbaeumer.vscode-eslint

# Prettier - code formatter
esbenp.prettier-vscode

# Better C++ Syntax highlighting
jeff-hykin.better-cpp-syntax

# CMake support (lightweight)
twxs.cmake

# Makefile Tools
ms-vscode.makefile-tools

# Native Debug - GDB/LLDB for C/C++
webfreak.debug

# Path Intellisense - autocomplete paths
christian-kohler.path-intellisense

# PDF Viewer - lightweight (7MB)
mathematic.vscode-pdf

# SQLTools - database client (MySQL, PostgreSQL, SQLite)
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
mtxr.sqltools-driver-sqlite

# Jenkins/CI-CD & Groovy
secanis.jenkinsfile-support
janjoerke.jenkins-pipeline-linter-connector
marlon407.code-groovy
NicolasVuillamy.vscode-groovy-lint

# ----- CUSTOM (built from source) -----
# LCC Tools - Built from GitHub source
# See Dockerfile for build step

# ===========================================
# OPTIONAL (installed but disabled by default)
# Students can enable these from Extensions panel
# ===========================================
James-Yu.latex-workshop
Vue.volar
bmewburn.vscode-intelephense-client
ms-azuretools.vscode-docker
ms-vscode.hexeditor
ms-vscode.cmake-tools
github.vscode-github-actions
vscjava.vscode-gradle
ritwickdey.liveserver
ecmel.vscode-html-css
dsznajder.es7-react-js-snippets
